# Ex2 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [132]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

In [133]:
df = pd.read_table('chipotle.tsv.txt', delimiter="\t")

### Step 3. Assign it to a variable called chipo.

In [134]:
chipo = df

### Step 4. See the first 10 entries

In [135]:
chipo[:10]

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

### Step 5. What is the number of observations in the dataset?

In [136]:
# Solution 1
chipo.shape[0]

4622

In [137]:
# Solution 2
chipo.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

### Step 6. What is the number of columns in the dataset?

In [138]:
chipo.shape[1]

5

### Step 7. Print the name of all the columns.

In [139]:
print(chipo.columns.values)

['order_id' 'quantity' 'item_name' 'choice_description' 'item_price']

### Step 8. How is the dataset indexed?

In [35]:
print(chipo.index.values)

[   0    1    2 ... 4619 4620 4621]

### Step 9. Which was the most-ordered item?

In [140]:
chi_max = chipo.groupby(['item_name']).sum()
chi_max = chi_max.sort_values(by=['quantity'], ascending=False)

In [141]:
chi_max.head(1)

              order_id  quantity
item_name
Chicken Bowl    713926       761

### Step 10. For the most-ordered item, how many items were ordered?

In [142]:
chi_max.head(1)

              order_id  quantity
item_name
Chicken Bowl    713926       761

### Step 11. What was the most ordered item in the choice_description column?

In [143]:
chi_max_co = chipo.groupby(['choice_description']).sum()
chi_max_co = chi_max_co.sort_values(by=['quantity'], ascending=False)
chi_max_co.head(1)

                    order_id  quantity
choice_description
[Diet Coke]           123455       159

### Step 12. How many items were orderd in total?

In [144]:
chi_total = chipo.quantity.sum()

In [145]:
chi_total

4972

### Step 13. Turn the item price into a float

In [117]:
float(df.at[1,'item_price'][1:-1])

3.39

In [125]:
for row in chipo.index:
    chipo.at[row,'item_price'] = float(df.at[row,'item_price'][1:-1])

#### Step 13.a. Check the item price type

In [129]:
print(type(chipo.iloc[1]['item_price']))

<class 'float'>

#### Step 13.b. Create a lambda function and change the type of item price

In [146]:
change = lambda x: float(x[1:-1])
chipo.item_price = chipo.item_price.apply(change)

#### Step 13.c. Check the item price type

In [147]:
print(type(chipo.iloc[1]['item_price']))

<class 'numpy.float64'>

### Step 14. How much was the revenue for the period in the dataset?

In [148]:
chi_revenue = (chipo['item_price']* chipo['quantity']).sum()

In [149]:
chi_revenue

39237.02

### Step 15. How many orders were made in the period?

In [152]:
chi_order = chipo.sort_values(by=['order_id'], ascending=False)

In [153]:
chi_order.head()

,order_id,quantity,item_name,choice_description,item_price
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",8.75
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",8.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",11.25
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",11.75
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",11.75

### Step 16. What is the average revenue amount per order?

In [154]:
# Solution 1
chipo['revenue'] = (chipo['item_price']* chipo['quantity'])
chi_average = chipo.groupby(['order_id']).sum().mean()['revenue']

In [156]:
chi_average

21.394231188658654

In [159]:
# Solution 2
chipo['revenue'] = (chipo['item_price']* chipo['quantity'])
chipo_average = chipo.groupby(['order_id']).sum()['revenue']
chi_average = chipo_average.mean()

In [160]:
chi_average

21.394231188658654

### Step 17. How many different items are sold?

In [173]:
chipo_item = chipo.groupby(['order_id']).count()

In [174]:
chipo_item

          quantity  item_name  choice_description  item_price  revenue
order_id
1                4          4                   2           4        4
2                1          1                   1           1        1
3                2          2                   1           2        2
4                2          2                   2           2        2
5                2          2                   1           2        2
...            ...        ...                 ...         ...      ...
1830             2          2                   2           2        2
1831             3          3                   1           3        3
1832             2          2                   1           2        2
1833             2          2                   2           2        2
1834             3          3                   3           3        3

[1834 rows x 5 columns]